[error]
1=卡未初始化或找不到卡！
2=复位失败！
3=卡版本不对！
4=报警！
6=执行失败！
7=状态不对应!
16=命令超时！
17=命令丢失!
18=接口调用异步！
19=接口被其它程序占用!
20=Z轴超限或校正文件损坏！
21=参数不匹配!
23=内存分配失败!
100=脱机使用中!
101=命令被中止!
1001=端口1
1002=端口2
1003=端口3
1004=端口4
1005=端口5
1006=端口6
1007=端口7
1008=激光输入没有准备好
1009=激光输入准备就绪

[4]
1 = 激光器过温，请关闭电源！
2 = 激光器高反报警，请关闭电源！
3 = 激光器MO异常，请关闭电源！
4 = 激光器盖子被打开，请关闭电源并装好激光器盖子！
5 = 安全门被打开，请关上安全门！
6 = 光闸关闭异常，请关闭电源并检查光闸！
7 = 光闸打开异常，请关闭电源并检查光闸！
8 = 安全门被打开，打标暂停，请关上安全门继续打标！
9 = 安全门被打开，打标中止！
10= 激光器系统报警，请关闭电源！
11= 激光器电源电压超范围，请关闭电源！
12= 激光器电源过压报警，请关闭电源并检查激光器电源！
13= 激光器电源欠压报警，请关闭电源并检查激光器电源！
14= SPI激光器过温报警，请关闭电源！
15= SPI激光器预备放大器过流报警，请关闭电源！
16= SPI激光器功率放大器过流报警，请关闭电源！
17= SPI激光器准直激光器报警，请关闭电源！
18= SPI激光器保留报警，请关闭电源！
19= SPI激光器电源报警，请关闭电源！
20= 激光器未知报警，请关闭电源！
21= 激光器电源过流报警，请关闭电源！
22= 激光器电源过压报警，请关闭电源！
23= 激光器电源过温报警，请关闭电源并检查散热条件！
24= 激光器电源未打开，请检查电源。
30= 运动过程中碰到负限位，打标被中止！
31= 运动过程中碰到正限位，打标被中止！
32= 电机脉冲超范围
33= 振镜DA超范围！
34= 平台X轴超正限位！
35= 平台X轴超负限位！
36= 平台Y轴超正限位！
37= 平台Y轴超负限位！
38= 振镜方头上电异常，请关闭电源并检查！
54=请切换到512校正表!
55=请切换到128校正表!
100=安全门有效且被打开!

110=碰到负限位!
111=碰到正限位!
112=运动中碰到原点!
500=振镜预热中，请稍侯再试!

[door]
1=安全门被打开，请关上安全门！
2=安全门被打开，打标暂停，请关上安全门继续打标！
3=安全门被打开，打标中止！
4=安全门已关上,可以继续打标！
5=安全门已关上,状态正常！
6=运动过程中碰到负限位，打标被中止！
7=运动过程中碰到正限位，打标被中止！

[usb]
1=EMCC卡已经连接
2=EMCC卡已经断开

[4101]
3=DA卡1功能与版本信息
4=DA卡1版本日期信息
5=DA卡1的运行时间
7=DA卡1的误码帧数
9=DA卡1倒数第4次误码的时间
11=DA卡1倒数第3次误码的时间
13=DA卡1倒数第2次误码的时间
15=DA卡1最后一次误码的时间

[4102]
4=DA卡1的失码帧数
6=DA卡1倒数第4次失码的时间
8=DA卡1倒数第3次失码的时间
10=DA卡1倒数第2次失码的时间
12=DA卡1最后一次失码的时间
14=DA卡1振镜报警信息
15=DA卡1振镜报警关激光使能

[4103]
3=DA卡2功能与版本信息
4=DA卡2版本日期信息
5=DA卡2的运行时间
7=DA卡2的误码帧数
9=DA卡2倒数第4次误码的时间
11=DA卡2倒数第3次误码的时间
13=DA卡2倒数第2次误码的时间
15=DA卡2最后一次误码的时间

[4104]
4=DA卡2的失码帧数
6=DA卡2倒数第4次失码的时间
8=DA卡2倒数第3次失码的时间
10=DA卡2倒数第2次失码的时间
12=DA卡2最后一次失码的时间
14=DA卡2振镜报警信息
15=DA卡2振镜报警关激光使能

[4105]
3=LASER卡功能与版本信息
4=LASER卡版本日期信息
5=LASER卡的运行时间
7=LASER卡的误码帧数
9=LASER卡倒数第4次误码的时间
11=LASER卡倒数第3次误码的时间
13=LASER卡倒数第2次误码的时间
15=LASER卡最后一次误码的时间

[4106]
4=LASER卡的失码帧数
6=LASER卡倒数第4次失码的时间
8=LASER卡倒数第3次失码的时间
10=LASER卡倒数第2次失码的时间
12=LASER卡最后一次失码的时间
14=LASER卡振镜报警信息
15=LASER卡激光器报警关激光使能

[4107]
3=LASER卡激光器当前ns波形
4=LASER卡激光器当前ps波形
5=LASER卡激光器当前fs波形
6=LASER卡激光器当前维持功率



[4102Warning]
0=D0:DA卡1 数据通讯异常
1=D1:DA卡1 Scanner系统报警
2=D2:DA卡1 Scanner温度报警
3=D3:DA卡1 Scanner低速报警
4=D4:未使用
5=D5:未使用
6=D6:未使用
7=D7:未使用
8=D8:未使用
9=D9:未使用
10=D10:未使用
11=D11:未使用
12=D12:未使用
13=D13:未使用
14=D14:未使用
15=D15:EMCC卡 数据通讯异常

[4104Warning]
0=D0:DA卡2 数据通讯异常
1=D1:DA卡2 Scanner系统报警
2=D2:DA卡2 Scanner温度报警
3=D3:DA卡2 Scanner低速报警
4=D4:未使用
5=D5:未使用
6=D6:未使用
7=D7:未使用
8=D8:未使用
9=D9:未使用
10=D10:未使用
11=D11:未使用
12=D12:未使用
13=D13:未使用
14=D14:未使用
15=D15:未使用

[4106Warning]
0=D0:LASER卡 数据通讯异常
1=D1:激光器温度报警
2=D2:电源报警
3=D3:系统报警
4=D4:高反报警
5=D5:激光器未准备好
6=D6:种子激光点火失败
7=D7:种子激光温度报警
8=D8:MO过流报警
9=D9:PA过流报警
10=D10:准直器报警
11=D11:保留报警5
12=D12:保留报警4
13=D13:保留报警3
14=D14:保留报警2
15=D15:保留报警1

[Refresh]
Interval=500
